app/Controllers/PengaduanController.php

SELECT *
FROM `laporan`
ORDER BY `id` ASC
---
    public function report()
    {
        $this->db = \Config\Database::connect();
        $builder = $this->db->table('laporan')->select('*');
        $query = $builder->orderBy('id', 'ASC')->get();

INSERT INTO `laporan` (`nama`, `alamat`, `tipe_laporan`, `deskripsi`) VALUES ('Uji Coba', 'Medan Kota', 'pencurian', 'Barang dicuri berupa handphone')
---
    public function add_data()
    {
        $model = new PengaduanModel();

        $model->insert([
            'nama'=>$this->request->getPost('nama'),
            'alamat'=>$this->request->getPost('alamat'),
            'tipe_laporan'=>$this->request->getPost('tipe_laporan'),
            'deskripsi'=>$this->request->getPost('deskripsi'),
        ]);